20250913T215858--kdoc-467-webアプリケーション全体について質問すること__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-27T23:18:53Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 467: Webアプリケーション全体について質問すること</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 467: Webアプリケーション全体について質問すること</h1>
<div id="outline-container-orge339848" class="outline-2">
<h2 id="orge339848"><a href="#orge339848">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orge339848">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-09-14 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2025-11-02 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7a2a660" class="outline-2">
<h2 id="org7a2a660"><a href="#org7a2a660">概要</a></h2>
<div class="outline-text-2" id="text-org7a2a660">
<p>
生成AIなどに調べさせてWebアプリケーション全体をおおまかに把握したいことがある。観点をまとめる。
</p>

<ul class="org-ul">
<li>UX
<ul class="org-ul">
<li>アプリケーションの目的</li>
<li>ドメイン知識</li>
<li>使用フロー</li>
<li>関係者の種別(顧客、社内担当者、社内承認者、システム管理者 &#x2026;)</li>
</ul></li>
<li>認証・認可
<ul class="org-ul">
<li>認証の仕組み</li>
<li>認証を維持する仕組み</li>
<li>認可の仕組み</li>
<li>使用するトークンの種類/目的/保存場所/発行/更新/無効</li>
</ul></li>
<li>通信の流れ
<ul class="org-ul">
<li>クライアントがサーバーにリクエストしてからレスポンスが返るまでの流れ</li>
<li>経路にあるプロトコル</li>
<li>経路にあるインフラ(リバースプロキシ / API Gateway / CDN &#x2026;)</li>
<li>キャッシュ(ブラウザキャッシュ / CDNキャッシュ / サーバーサイドキャッシュ &#x2026;)</li>
</ul></li>
<li>フロントエンド
<ul class="org-ul">
<li>アーキテクチャ</li>
<li>フロントエンド配信の方法(署名付きURLやキャッシュ制御)</li>
<li>ページ描画の種別(SPA, SSR, &#x2026;)と方法</li>
<li>認証情報の保存場所(Cookie, LocalStorage, Memory, &#x2026;)</li>
</ul></li>
<li>バックエンド
<ul class="org-ul">
<li>アーキテクチャ</li>
<li>API の役割とエンドポイントの設計</li>
<li>データベースとのやりとり(ORM, クエリ, トランザクション)</li>
<li>セッション管理・状態管理(ステートフル / ステートレス)</li>
<li>ユーザ管理(作成、削除)</li>
</ul></li>
<li>データ
<ul class="org-ul">
<li>永続化データ種別(RDBMS, NoSQL, 静的ファイル)</li>
<li>テーブル構造</li>
<li>マイグレーション方法</li>
<li>シーディング方法(開発環境)</li>
<li>静的ファイルアップロード方法</li>
<li>テーブルごとのデータ量
<ul class="org-ul">
<li>読み書き量の統計</li>
</ul></li>
</ul></li>
<li>インフラ
<ul class="org-ul">
<li>アーキテクチャ</li>
<li>使用するクラウドサービス(AWS Lambda, ECS, Kubernetes, RDS, S3…)</li>
<li>各サービスの目的(ストレージ、計算、ネットワーク)</li>
<li>インフラとアプリケーションの連携方法(環境変数、Secrets Manager、VPC内通信)</li>
<li>各インスタンスのサブネットでの位置</li>
</ul></li>
<li>セキュリティ
<ul class="org-ul">
<li>通信の暗号化(TLS)</li>
<li>秘密情報の管理(APIキー、DBパスワード)</li>
<li>脆弱性対策(XSS, CSRF, SQL Injection)</li>
</ul></li>
<li>運用・監視
<ul class="org-ul">
<li>ログの収集と可視化の方法(アプリログ、アクセスログ、監査ログ)</li>
<li>メトリクス収集(リクエスト数、エラーレート、レスポンスタイム)</li>
<li>アラート設計と対応フロー</li>
<li>デプロイ戦略(Blue/Green, Canary, Rolling Update)</li>
<li>メンテナンスSQLを実行する方法</li>
<li>スケーリング手法</li>
</ul></li>
<li>開発プロセス
<ul class="org-ul">
<li>CI/CD の流れ</li>
<li>テストのカバー範囲</li>
<li>テスト手法、粒度(ユニットテスト、統合テスト、E2Eテスト)</li>
<li>IaC(Terraform, CloudFormation)によるインフラ管理方法</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org5e477a1" class="outline-2">
<h2 id="org5e477a1"><a href="#org5e477a1">関連</a></h2>
<div class="outline-text-2" id="text-org5e477a1">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
